In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [3]:
np.random.seed(100)

In [4]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [5]:
df

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [7]:
df['W']

A   -1.749765
B    0.981321
C   -0.189496
D   -0.583595
E   -0.531280
Name: W, dtype: float64

In [8]:
df['NEW'] = df['W'] + df['X']

In [9]:
df

          W         X         Y         Z       NEW
A -1.749765  0.342680  1.153036 -0.252436 -1.407085
B  0.981321  0.514219  0.221180 -1.070043  1.495540
C -0.189496  0.255001 -0.458027  0.435163  0.065506
D -0.583595  0.816847  0.672721 -0.104411  0.233252
E -0.531280  1.029733 -0.438136 -1.118318  0.498452

In [10]:
df.loc['A']

W     -1.749765
X      0.342680
Y      1.153036
Z     -0.252436
NEW   -1.407085
Name: A, dtype: float64

In [13]:
df.iloc[2]

W     -0.189496
X      0.255001
Y     -0.458027
Z      0.435163
NEW    0.065506
Name: C, dtype: float64

In [14]:
df

          W         X         Y         Z       NEW
A -1.749765  0.342680  1.153036 -0.252436 -1.407085
B  0.981321  0.514219  0.221180 -1.070043  1.495540
C -0.189496  0.255001 -0.458027  0.435163  0.065506
D -0.583595  0.816847  0.672721 -0.104411  0.233252
E -0.531280  1.029733 -0.438136 -1.118318  0.498452

In [12]:
df.iloc[3:5,3:5]

          Z       NEW
D -0.104411  0.233252
E -1.118318  0.498452

In [18]:
df[df > 0 ]

          W         X         Y         Z       NEW
A       NaN  0.342680  1.153036       NaN       NaN
B  0.981321  0.514219  0.221180       NaN  1.495540
C       NaN  0.255001       NaN  0.435163  0.065506
D       NaN  0.816847  0.672721       NaN  0.233252
E       NaN  1.029733       NaN       NaN  0.498452

In [19]:
df

          W         X         Y         Z       NEW
A -1.749765  0.342680  1.153036 -0.252436 -1.407085
B  0.981321  0.514219  0.221180 -1.070043  1.495540
C -0.189496  0.255001 -0.458027  0.435163  0.065506
D -0.583595  0.816847  0.672721 -0.104411  0.233252
E -0.531280  1.029733 -0.438136 -1.118318  0.498452

In [17]:
df[df['W'] > 0]

          W         X        Y         Z      NEW
B  0.981321  0.514219  0.22118 -1.070043  1.49554

In [21]:
df[(df['W'] > 0) & (df['X'] >0.5)]

          W         X        Y         Z      NEW
B  0.981321  0.514219  0.22118 -1.070043  1.49554

In [22]:
df

          W         X         Y         Z       NEW
A -1.749765  0.342680  1.153036 -0.252436 -1.407085
B  0.981321  0.514219  0.221180 -1.070043  1.495540
C -0.189496  0.255001 -0.458027  0.435163  0.065506
D -0.583595  0.816847  0.672721 -0.104411  0.233252
E -0.531280  1.029733 -0.438136 -1.118318  0.498452

In [25]:
df.reset_index()

  index         W         X         Y         Z       NEW
0     A -1.749765  0.342680  1.153036 -0.252436 -1.407085
1     B  0.981321  0.514219  0.221180 -1.070043  1.495540
2     C -0.189496  0.255001 -0.458027  0.435163  0.065506
3     D -0.583595  0.816847  0.672721 -0.104411  0.233252
4     E -0.531280  1.029733 -0.438136 -1.118318  0.498452

In [28]:
lis = 'xx yy zz ww'.split()
lis

['xx', 'yy', 'zz', 'ww']

In [31]:
df.set_index('NEW')

                  W         X         Y         Z
NEW
-1.407085 -1.749765  0.342680  1.153036 -0.252436
 1.495540  0.981321  0.514219  0.221180 -1.070043
 0.065506 -0.189496  0.255001 -0.458027  0.435163
 0.233252 -0.583595  0.816847  0.672721 -0.104411
 0.498452 -0.531280  1.029733 -0.438136 -1.118318